Mico02/MSP430-DHT11/DHT11.c
/*
 * DHT11.c
 *
 *  Created on: Jul 1, 2024
 *      Author: mohamedhussein
 */
#include "DHT11.h"
#include "driverlib.h"
#include <stdint.h>
#include <stdio.h>

/****** HELPER FUNCTIONS *****/

/**
 * Sets a GPIO pin as output given its port and pin.
 * @param port : port of pin
 * @param pin  : pin number
 */
void setPortOutput(uint8_t port, uint8_t pin){
    //Checks what port was chosen and SETS the bit for the corresponding pin in PxDIR register
    switch(port){
        case 1:
            P1DIR |= (1 << pin);
            break;
        case 2:
            P2DIR |= (1 << pin);
            break;
        case 3:
            P3DIR |= (1 << pin);
            break;
        case 4:
            P4DIR |= (1 << pin);
            break;
        case 5:
            P5DIR |= (1 << pin);
            break;
        case 6:
            P6DIR |= (1 << pin);
            break;
        case 7:
            P7DIR |= (1 << pin);
            break;
        case 8:
            P8DIR |= (1 << pin);
            break;
        case 9:
            P9DIR |= (1 << pin);
            break;
        default:
            break;
    }
}


/**
 * Sets a GPIO pin as input given its port and pin.
 * @param port : port of pin
 * @param pin  : pin number
 */
void setPortInput(uint8_t port, uint8_t pin){
    //Checks what port was chosen and RESETS the bit for the corresponding pin in PxDIR register
    switch(port){
        case 1:
            P1DIR &= ~(1 << pin);
            break;
        case 2:
            P2DIR &= ~(1 << pin);
            break;
        case 3:
            P3DIR &= ~(1 << pin);
            break;
        case 4:
            P4DIR &= ~(1 << pin);
            break;
        case 5:
            P5DIR &= ~(1 << pin);
            break;
        case 6:
            P6DIR &= ~(1 << pin);
            break;
        case 7:
            P7DIR &= ~(1 << pin);
            break;
        case 8:
            P8DIR &= ~(1 << pin);
            break;
        case 9:
            P9DIR &= ~(1 << pin);
            break;
        default:
            break;
    }
}


/**
 * Sets a GPIO pin as HIGH given its port and pin, pin must be set at output
 * @param port : port of pin
 * @param pin  : pin number
 */
void setPinHigh(uint8_t port, uint8_t pin){
    //Checks what port was chosen and SETS the bit for the corresponding pin in PxOUT register
    switch(port){
		case 1:
		    P1OUT |= (1 << pin);
		    break;
		case 2:
		    P2OUT |= (1 << pin);
		    break;
		case 3:
		    P3OUT |= (1 << pin);
		    break;
		case 4:
		    P4OUT |= (1 << pin);
		    break;
		case 5:
		    P5OUT |= (1 << pin);
		    break;
		case 6:
		    P6OUT |= (1 << pin);
		    break;
		case 7:
		    P7OUT |= (1 << pin);
		    break;
		case 8:
		    P8OUT |= (1 << pin);
		    break;
		case 9:
		    P9OUT |= (1 << pin);
		    break;
		default:
		    break;
    }
}


/**
 * Sets a GPIO pin as LOW given its port and pin, pin must be set at output
 * @param port : port of pin
 * @param pin  : pin number
 */
void setPinLow(uint8_t port, uint8_t pin){
    //Checks what port was chosen and RESETS the bit for the corresponding pin in PxOUT register
    switch(port){
        case 1:
            P1OUT &= ~(1 << pin);
            break;
        case 2:
            P2OUT &= ~(1 << pin);
            break;
        case 3:
            P3OUT &= ~(1 << pin);
            break;
        case 4:
            P4OUT &= ~(1 << pin);
            break;
        case 5:
            P5OUT &= ~(1 << pin);
            break;
        case 6:
            P6OUT &= ~(1 << pin);
            break;
        case 7:
            P7OUT &= ~(1 << pin);
            break;
        case 8:
            P8OUT &= ~(1 << pin);
            break;
        case 9:
            P9OUT &= ~(1 << pin);
            break;
        default:
            break;
        }
}


/**
 * Initializes the DHT sensor on the given port and pin
 * @param port : port of pin
 * @param pin  : pin number
 */
void DHT11_init(DHT11* sensor, int port, int pin){

    //Clock setup
    WDT_A_hold(WDT_A_BASE); // disable wdt
    PMM_unlockLPM5(); // unlock all pins
    int temp = CSCTL0_H;
    CSCTL0_H = CSKEY_H; // unlock clock control registers
    CSCTL1 = 0x0000; // set DCO to 1MHZ
    CSCTL3 = 0x0000; // no division on clocks
    CSCTL0_H = temp; // lock clock control registers

    //allocating memory and setting struct variables to match port & pin
    sensor = malloc(sizeof(DHT11));
    sensor->port = port;
    sensor->pin = pin;

    __delay_cycles(1000000); // wait 1 second after initialization
}


float DHT11_readTemperature(DHT11* sensor){
    /* Setting pin low for 20ms as start signal for dh */
    setPortOutput(sensor->port, sensor->pin);
    setPinLow(sensor->port, sensor->pin);
    __delay_cycles(20000);
    /* disabling output to pull up with external pull-up resistor */
    setPortInput(sensor->port, sensor->pin);

    //SET THE SENSORS PIN AS A TIMER USING P1.5
    P1SEL1 |= BIT5;
    P1SEL0 &= ~BIT5;



    //TA0CTL = 0b 0000 0010 0010 0011;
     //Connect TA0 to SMCLK,
    /* waiting for 80us low and 80us high */
    __delay_cycles(160);
    //START THE TIMER
    return 0;

}



float DHT11_readHumidity(DHT11* sensor);
void DHT11_readTempHumd(DHT11* sensor, float* temperature, float* humidity);

